oneWayCoupledVdfTransportFoam/TaylorGreen/0/T.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform 300;

boundaryField
{
    top
    {
        type    cyclic;
    }
    bottom
    {
        type    cyclic;
    }
    left
    {
        type    cyclic;
    }
    right
    {
        type    cyclic;
    }
    front
    {
        type    empty;
    }
    back
    {
        type    empty;
    }
}


// ************************************************************************* //
