oneWayCoupledVdfTransportFoam/TaylorGreen/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel velocity;

velocityCoeffs
{
    odeCoeffs
    {
        solveSources off;

        ATol    1.0e-6;
        RTol    1.0e-4;
        fac     0.9;
        facMin  0.1;
        facMax  5.0;
        minLocalDt 1.0e-4;
    }

    collision  off;

    collisionKernel
    {
        collisionKernel noCollision;
        e           0.8;
        tau         tau     [0 0 1 0 0 0 0]     0.3;
    }
}

// ************************************************************************* //
